In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[ 0.62706628, -0.42370729, -1.68289323],
       [ 0.5648839 ,  0.29836295,  0.03979917],
       [ 0.93337626, -0.81893246,  0.57363282],
       [ 1.16592875,  0.40170736,  0.73632529]])

In [5]:
data_frame = pd.DataFrame(data)

In [6]:
data_frame

          0         1         2
0  0.627066 -0.423707 -1.682893
1  0.564884  0.298363  0.039799
2  0.933376 -0.818932  0.573633
3  1.165929  0.401707  0.736325

In [7]:
type(data_frame)

pandas.core.frame.DataFrame

In [8]:
type(data_frame[0])

pandas.core.series.Series

In [9]:
new_df = pd.DataFrame(data, index = ["Yiğit","Alperen","Bekiroğlu","Şen"], columns = ["Salary","Age","Seniority"])

In [10]:
new_df

             Salary       Age  Seniority
Yiğit      0.627066 -0.423707  -1.682893
Alperen    0.564884  0.298363   0.039799
Bekiroğlu  0.933376 -0.818932   0.573633
Şen        1.165929  0.401707   0.736325

In [11]:
new_df["Salary"]

Yiğit        0.627066
Alperen      0.564884
Bekiroğlu    0.933376
Şen          1.165929
Name: Salary, dtype: float64

In [12]:
new_df["Age"]

Yiğit       -0.423707
Alperen      0.298363
Bekiroğlu   -0.818932
Şen          0.401707
Name: Age, dtype: float64

In [13]:
new_df[["Age","Salary"]]

                Age    Salary
Yiğit     -0.423707  0.627066
Alperen    0.298363  0.564884
Bekiroğlu -0.818932  0.933376
Şen        0.401707  1.165929

In [15]:
new_df.loc["Yiğit"]

Salary       0.627066
Age         -0.423707
Seniority   -1.682893
Name: Yiğit, dtype: float64

In [16]:
new_df.iloc[0]

Salary       0.627066
Age         -0.423707
Seniority   -1.682893
Name: Yiğit, dtype: float64

In [17]:
new_df.iloc[:,2]

Yiğit       -1.682893
Alperen      0.039799
Bekiroğlu    0.573633
Şen          0.736325
Name: Seniority, dtype: float64

In [18]:
new_df["Ekstra"] = 10

In [19]:
new_df

             Salary       Age  Seniority  Ekstra
Yiğit      0.627066 -0.423707  -1.682893      10
Alperen    0.564884  0.298363   0.039799      10
Bekiroğlu  0.933376 -0.818932   0.573633      10
Şen        1.165929  0.401707   0.736325      10

In [21]:
new_df.drop("Ekstra", axis = 1)

             Salary       Age  Seniority
Yiğit      0.627066 -0.423707  -1.682893
Alperen    0.564884  0.298363   0.039799
Bekiroğlu  0.933376 -0.818932   0.573633
Şen        1.165929  0.401707   0.736325

In [22]:
new_df

             Salary       Age  Seniority  Ekstra
Yiğit      0.627066 -0.423707  -1.682893      10
Alperen    0.564884  0.298363   0.039799      10
Bekiroğlu  0.933376 -0.818932   0.573633      10
Şen        1.165929  0.401707   0.736325      10

In [25]:
new_df.drop("Ekstra",axis = 1, inplace = True)

In [26]:
new_df

             Salary       Age  Seniority
Yiğit      0.627066 -0.423707  -1.682893
Alperen    0.564884  0.298363   0.039799
Bekiroğlu  0.933376 -0.818932   0.573633
Şen        1.165929  0.401707   0.736325

In [27]:
new_df.drop("Şen")

             Salary       Age  Seniority
Yiğit      0.627066 -0.423707  -1.682893
Alperen    0.564884  0.298363   0.039799
Bekiroğlu  0.933376 -0.818932   0.573633

In [28]:
new_df.loc["Yiğit"]

Salary       0.627066
Age         -0.423707
Seniority   -1.682893
Name: Yiğit, dtype: float64

In [29]:
new_df.loc["Yiğit"]["Age"]

-0.4237072948717343

In [30]:
new_df.loc["Yiğit","Age"]

-0.4237072948717343

In [31]:
new_df.loc["Yiğit","Age"] = 100

In [32]:
new_df

             Salary         Age  Seniority
Yiğit      0.627066  100.000000  -1.682893
Alperen    0.564884    0.298363   0.039799
Bekiroğlu  0.933376   -0.818932   0.573633
Şen        1.165929    0.401707   0.736325

In [33]:
new_df > 0

           Salary    Age  Seniority
Yiğit        True   True      False
Alperen      True   True       True
Bekiroğlu    True  False       True
Şen          True   True       True

In [34]:
boolean_frame = new_df > 0

In [36]:
new_df[boolean_frame]

             Salary         Age  Seniority
Yiğit      0.627066  100.000000        NaN
Alperen    0.564884    0.298363   0.039799
Bekiroğlu  0.933376         NaN   0.573633
Şen        1.165929    0.401707   0.736325

In [38]:
new_df[new_df > 0]

             Salary         Age  Seniority
Yiğit      0.627066  100.000000        NaN
Alperen    0.564884    0.298363   0.039799
Bekiroğlu  0.933376         NaN   0.573633
Şen        1.165929    0.401707   0.736325

In [39]:
new_df[new_df["Age"] > 1]

         Salary    Age  Seniority
Yiğit  0.627066  100.0  -1.682893

In [40]:
new_df

             Salary         Age  Seniority
Yiğit      0.627066  100.000000  -1.682893
Alperen    0.564884    0.298363   0.039799
Bekiroğlu  0.933376   -0.818932   0.573633
Şen        1.165929    0.401707   0.736325

In [41]:
new_df.reset_index()

       index    Salary         Age  Seniority
0      Yiğit  0.627066  100.000000  -1.682893
1    Alperen  0.564884    0.298363   0.039799
2  Bekiroğlu  0.933376   -0.818932   0.573633
3        Şen  1.165929    0.401707   0.736325

In [42]:
reset_frame = new_df.reset_index()

In [43]:
reset_frame

       index    Salary         Age  Seniority
0      Yiğit  0.627066  100.000000  -1.682893
1    Alperen  0.564884    0.298363   0.039799
2  Bekiroğlu  0.933376   -0.818932   0.573633
3        Şen  1.165929    0.401707   0.736325

In [44]:
reset_frame.loc[0]

index           Yiğit
Salary       0.627066
Age             100.0
Seniority   -1.682893
Name: 0, dtype: object

In [45]:
new_indices = ["ygt","alp","bek","sn"]

In [46]:
new_df["NewIndex"] = new_indices

In [47]:
new_df

             Salary         Age  Seniority NewIndex
Yiğit      0.627066  100.000000  -1.682893      ygt
Alperen    0.564884    0.298363   0.039799      alp
Bekiroğlu  0.933376   -0.818932   0.573633      bek
Şen        1.165929    0.401707   0.736325       sn

In [49]:
new_df.set_index("NewIndex",inplace = True)

In [50]:
new_df

            Salary         Age  Seniority
NewIndex
ygt       0.627066  100.000000  -1.682893
alp       0.564884    0.298363   0.039799
bek       0.933376   -0.818932   0.573633
sn        1.165929    0.401707   0.736325

In [52]:
new_df.loc["ygt"]

Salary         0.627066
Age          100.000000
Seniority     -1.682893
Name: ygt, dtype: float64

In [53]:
# multi index

In [54]:
first_index = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [55]:
inner_index = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [56]:
zipped_index = list(zip(first_index,inner_index))

In [57]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [58]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [59]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [60]:
sample_values = np.ones((6,2))

In [61]:
big_df = pd.DataFrame(sample_values, index = zipped_index, columns= ["Age","Salary"])

In [62]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [63]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [66]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0

In [67]:
big_df.loc["Simpson"].loc["Homer"]

Age       1.0
Salary    1.0
Name: Homer, dtype: float64